app/controllers/domains_controller.rb

SELECT "domains".* FROM "domains"
---
  def index
    @domains = Domain.search(params[:search]).order(sort_column + " " + sort_direction).paginate(:per_page => 10, :page => params[:page])

SELECT "domains".* FROM "domains" WHERE "domains"."id" = 1 LIMIT 1
---
  def show
    @domain = Domain.find(params[:id])

SELECT "domains".* FROM "domains" WHERE "domains"."id" = 1 LIMIT 1
---
  def edit
    @domain = Domain.find(params[:id])

INSERT INTO "domains" ("updated_at", "created_at", "domain") VALUES ('2011-07-19 18:56:35.801009', '2011-07-19 18:56:35.801009', 'sudoash.com')
---
  def create
    @domain = Domain.new(params[:domain])
    add_crumb 'New'

    if @domain.save

SELECT "domains".* FROM "domains" WHERE "domains"."id" = 3 LIMIT 1
---
  def update
    @domain = Domain.find(params[:id])

SELECT "domains".* FROM "domains" WHERE "domains"."id" = 2 LIMIT 1
DELETE FROM "domains" WHERE "domains"."id" = 2
---
  def destroy
    @domain = Domain.find(params[:id])
    @domain.destroy