app/controllers/mailboxes_controller.rb

SELECT "domains".* FROM "domains" WHERE "domains"."id" = 1 LIMIT 1
SELECT "mailboxes".* FROM "mailboxes" WHERE ("mailboxes".domain_id = 1)
---
  def index
    @domain = Domain.find(params[:domain_id])
    # @mailboxes = Mailbox.all
    @mailboxes = @domain.mailboxes.all

SELECT "domains".* FROM "domains" WHERE "domains"."id" = 3 LIMIT 1
SELECT "mailboxes".* FROM "mailboxes" WHERE "mailboxes"."id" = 2 AND ("mailboxes".domain_id = 3) LIMIT 1
---
  def show
    @domain = Domain.find(params[:domain_id])
    @mailbox = @domain.mailboxes.find(params[:id])

SELECT "domains".* FROM "domains" WHERE "domains"."id" = 3 LIMIT 1
---
  def new
    @domain = Domain.find(params[:domain_id])

SELECT "domains".* FROM "domains" WHERE "domains"."id" = 1 LIMIT 1
SELECT "mailboxes".* FROM "mailboxes" WHERE "mailboxes"."id" = 1 AND ("mailboxes".domain_id = 1) LIMIT 1
---
  def edit
    @domain = Domain.find(params[:domain_id])
    # @mailbox = Mailbox.find(params[:id])
    @mailbox = @domain.mailboxes.find(params[:id])

SELECT "domains".* FROM "domains" WHERE "domains"."id" = 3 LIMIT 1
INSERT INTO "mailboxes" ("created_at", "domain_id", "password", "updated_at", "email") VALUES ('2011-07-19 20:26:59.115045', 3, 'welcome!@£!!@£!@£', '2011-07-19 20:26:59.115045', 'test@sudoash.com')
---
  def create
    @domain = Domain.find(params[:domain_id])
    @mailbox = @domain.mailboxes.build(params[:mailbox])

    respond_to do |format|
      if @mailbox.save

SELECT "domains".* FROM "domains" WHERE "domains"."id" = 3 LIMIT 1
SELECT "mailboxes".* FROM "mailboxes" WHERE "mailboxes"."id" = 2 AND ("mailboxes".domain_id = 3) LIMIT 1
UPDATE "mailboxes" SET "password" = 'welcome!!!!', "updated_at" = '2011-07-19 20:26:45.353157' WHERE "mailboxes"."id" = 2
---
  def update
    @domain = Domain.find(params[:domain_id])
    @mailbox = @domain.mailboxes.find(params[:id])

    respond_to do |format|
      if @mailbox.update_attributes(params[:mailbox])

SELECT "domains".* FROM "domains" WHERE "domains"."id" = 3 LIMIT 1
SELECT "mailboxes".* FROM "mailboxes" WHERE "mailboxes"."id" = 4 AND ("mailboxes".domain_id = 3) LIMIT 1
DELETE FROM "mailboxes" WHERE "mailboxes"."id" = 4
---
  def destroy
    @domain = Domain.find(params[:domain_id])
    @mailbox = @domain.mailboxes.find(params[:id])
    @mailbox.destroy